# 3) Напишите программу, которая определит 
# позицию второго вхождения строки в списке 
# либо сообщит, что её нет.

# Пример:

# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1




list = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
m = [i for i in range(6)]
print('list[5]:', list[5])

